---
kind: method
id: M:Autodesk.Revit.DB.DWGImportOptions.#ctor
source: html/048b2492-aff5-a7e4-31e7-e53e18e8f748.htm
---
# Autodesk.Revit.DB.DWGImportOptions.#ctor Method

Constructs a new instance of DWGImportOptions with default values of all properties.

## Syntax (C#)
```csharp
public DWGImportOptions()
```